/*
	File:		ResultsViewStrings.strings

	Contains:
	Copyright:	© 2007-2009 by Apple Inc., all rights reserved.
*/

"SEARCH_WINDOW_RESULTS_COUNT_SINGULAR" = "%d result"; /* This will be used when the count is 1 */
"SEARCH_WINDOW_RESULTS_COUNT" = "%d results";
"SEARCH_WINDOW_RESULTS_NO_COUNT" = "Results";
"SEARCH_WINDOW_RESULTS_NO_RESULTS" = "No Results";

"SHOW_ALL_N" = "Show all %d";
"SHOW_TOP_COUNT" = "Show top %d";
"MORE_TITLE_FORMAT" = "More…";

"PREVIEW_TRASH" = "Trash";
"PREVIEW_WHERE" = "Where";
"PREVIEW_ITUNES_LIBRARY" = "iTunes Music Library";
"PREVIEW_MESSAGE_FROM" = "From";
"PREVIEW_MESSAGE_TO" = "To";
"PREVIEW_MESSAGE_RECIEVED" = "Received";
"PREVIEW_MESSAGE_SUBJECT" = "Subject";
"PREVIEW_MESSAGE_FOLDER" = "Folder";
"PREVIEW_DIMENSIONS" = "Dimensions";
"PREVIEW_PIXEL_DIMENSIONS" = "%@ x %@ pixels";   /* Dimensions in pixels */
"PREVIEW_POINT_DIMENSIONS" = "%@ x %@ points";   /* Dimensions in points */
"PREVIEW_POINT_INCH_DIMENSIONS" = "%@ x %@ in";  /* Dimensions in inches */
"PREVIEW_POINT_CM_DIMENSIONS"  = "%@ x %@ cm";   /* Dimensions in centimeters */
"PREVIEW_ICAL_LOCATION" = "Location";
"PREVIEW_ICAL_CALENDAR" =  "Calendar";
"PREVIEW_ICAL_START_DATE" = "Start date";
"PREVIEW_ICAL_DUE_DATE" = "Due date";
"PREVIEW_ICAL_ATTENDEES" = "Attendees";
"PREVIEW_ARTICLE_POSTED" = "Date posted";
"PREVIEW_BOOLEAN_TRUE" = "yes";
"PREVIEW_BOOLEAN_FALSE" = "no";

/* Used in the bottom preview in the Show all window, both of these strings are used in a stringWithFormat: and i pass along
 * the number of items
 */
"PREVIEW_NOTHING_SELECTED_SINGULAR" = "Nothing selected";
"PREVIEW_NOTHING_SELECTED_PLURAL" = "%d item selected";
"PREVIEW_ONE_SELECTED" = "1 item selected";

"NO_MAIL_SUBJECT" = "No Subject";

"FIELD_INDEXING_DISKS_TOOLTIP" = "Indexing volumes (%d%% done)";
"FIELD_INDEXING_TOOLTIP_CALCULATING" = "Indexing volumes";

/* Date link attributes */
"LINK_SEARCH_DATE" = "Search on %@";
"LINK_SEARCH_DATE_RANGE" = "Week of %@ to %@";
"LINK_SEARCH_MONTH_RANGE" = "Month from %@ to %@";
"LINK_SEARCH_YEAR_RANGE" = "Year from %@ to %@";
"LINK_SEARCH_DATE_NEWER" = "Newer than %@";

/* This is used as the separator between the name and the directory component in the Search menu */
"EMDASH" = "—";

/* These are titles for the Save/Edit saved search button in the scope bar. */
"SAVED_SEARCH_EDIT" = "Edit";
"SAVED_SEARCH_SAVE" = "Save";

/* button bar labels */
"SEARCH_WINDOW_PREVIEW_BUTTON" = "Preview";

"TEXT_SNIPPET_RANGE_SEPARATOR" = "…";

"KIND_MAIL_MSG" = "Mail Message";
"KIND_ICAL_EVENT" = "iCal Event";
"KIND_ICAL_TODO" = "iCal To-Do";

"SEARCH_NAME_AND_ATTRIBUTES" = "Name & Attributes";
"SEARCH_NAME_ONLY" = "Name Only";
"SEARCH_ADVANCED" = "Advanced";

/* the 'other...' menu item is used to bring up panel of other attributes to choose from. */
"OTHER_ATTRIBUTE_SLICE_MENU" = "Other…";

/* raw query slice support.  The raw query slice appears when you select it from the other... drop down in the advanced search */
"RAW_QUERY_SLICE_NAME" = "Raw query";
"RAW_QUERY_SLICE_DESCRIPTION" = "A raw query predicate to be included with the search";

/* file extension slice support.  The file extension slice appears when you select it from the other... drop down in the advanced search */
"FILE_EXTENSION_SLICE_NAME" = "File extension";
"FILE_EXTENSION_SLICE_DESCRIPTION" = "The filename extension of the item";

/* system files slice support.  The system files slice appears when you select it from the other... drop down in the advanced search */
"SYSTEM_FILES_SLICE_NAME" = "System files";
"SYSTEM_FILES_SLICE_DESCRIPTION" = "Include system files, such as preference files and plug-ins";

/* spotlight items slice support.  The spotlight items slice appears when you select it from the other... drop down in the advanced search */
"SPOTLIGHT_ITEMS_SLICE_NAME" = "Spotlight items";
"SPOTLIGHT_ITEMS_SLICE_DESCRIPTION" = "Include contacts, mail, events, webpages, and more";

/* titles for additional columns */
"CATEGORY_COLUMN_TITLE" = "Category";
